
from FallenMusic import BOT_NAME

PM_START_TEXT = """
**{0} : مرحباً بك عزيزي 

انا بوت تشغيل موسيقى صوتية ومرئية .⚡
قم بإضافة البوت إلي مجموعتك او قناتك .⚡
سيتم تفعيل البوت وانضمام المساعد تلقائياً
في حال مواجهت مشاكل راسل المطور
{1}
استخدم الازرار لمعرفه اوامر الاستخدام .⚡**
"""

START_TEXT = """
**{0} : مرحباً بك عزيزي 

انا بوت تشغيل موسيقى صوتية ومرئية .⚡
قم بإضافة البوت إلي مجموعتك او قناتك .⚡
سيتم تفعيل البوت وانضمام المساعد تلقائياً
في حال مواجهت مشاكل انضم هنا 
{1}
استخدم الازرار لمعرفه اوامر الاستخدام .⚡**
"""

HELP_TEXT = f"""
◍ اوامر الادمنيه والاعضاء ↓
        
‣╢ /play «» لتشغيل اغنيه
‣╢ /pause «» لأيقاف اغنيه مؤقتا
‣╢ /resume «» لتكمله الاغنيه
‣╢ /skip «» لتخطي الاغنيه
‣╢ /end «» لأيقاف الاغنيه
‣╢ /song «» لتحميل أغنيه
‣╢ /search «» للبحث في يوتيوب

‣ By @E_E_9_9
"""

HELP_SUDO = f"""
◍ اوامر المطورين ↓
        
‣╢ /avtivevc «» لجلب المكالمات النشطة
‣╢ /eval «» لتشغيل كود برمجي
‣╢ /speedtest «» لفحص السرعه
‣╢ /stats «» معلومات السيرفر
‣╢ /setname «» وضع اسم للمساعد
‣╢ /setbio «» وضع بايو للمساعد
‣╢ /setpic «» وضع صوره للمساعد
‣╢ /delpic «» حذف صوره المساعد

‣ By @E_E_9_9
"""

HELP_DEV = f"""
◍ اوامر المبرمج ↓
        
‣╢ /config «» للحصول على فارات
‣╢ /brodcast «» لعمل اذاعه
‣╢ /rmdownloads «» لحذف تخزين
‣╢ /leaveall «» لمغادره حساب مساعد
‣╢ /addsudo «» لرفع شخص مطور
‣╢ /rmsudo «» لتنزيل شخص مطور

‣ By @E_E_9_9
"""
HOW_USE = """**طريقة تفعيل البوت في مجموعتك ⚡♥️:
1.) اولا قم بإضافة البوت اللي مجموعتك ⚡.
2.) قم بترقيه البوت مشرف مع الصلاحيات المطلوبة ⚡.
3.)  قم بإضافة الحساب المساعد اللي المجموعة ⚡.
4.) تاكد من تشغيل المحادثة المرئية ⚡.
📌  اذا لم يستطع الحساب المساعد الانضمام اللي المحادثة المرئيه قم بإعادة تشغيل المحادثه ⚡.
💡 في حال واجهت اي مشكلة اخري يمكنك التواصل مع المطور من هن : {0}
⚡  Source: {1}**"""